<a href="https://colab.research.google.com/github/btramduong0810/dsc-mod-1-project-v2-1-online-ds-sp-000/blob/master/Data_Science_in_Action_The_Movie_Industry.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Final Project Submission

* Student name: **BAO TRAM DUONG**
* Student pace: **SELF-PACED DATA SCIENCE PROGRAM**
* Scheduled project review date/time: **12/16/2020 11:30AM**
* Instructor name: **JEFF HERMAN**
* Blog post URL: https://baotramduong.medium.com/data-science-vs-the-movie-industry-8e5645d1c88c

# **Part I: Table of Contents**

**1.  Introduction**

1.1  Business Statement

**2.  Data Cleaning & Preparation From Provided Data**

I.2.1 Methodology

I.2.2 Data Sources:

        - Box Office Mojo
        - IMDB
        - Rotten Tomatoes
        - TheMovieDB.org
        
I.2.3 Data reading

I.2.4 Data cleaning

        I.2.4.a Production budget & gross:

        - Budget
        - Domestic gross, worldwide gross
        - Studio
        
        I.2.4.b Movie Basics:
        
        - Runtime
        - Genre
        
        I.2.4.c Populatiry / Words of mouth: 

        - Vote count
        - Vote average
        - Popularity       
        - Language
        
I.2.5 Joining the dataframes

         - Production budget & gross: movie_budgets_gross_df
         - Movie basics: release date, genre, runtime: title_basics_df
         - Popularity/ Words of mouth: vote count, vote average, popularity score: 
           title_basics_rating_df
         - Production crew: director, writer: names_titles_df
         - All together: merged_df_1

# **1. INTRODUCTION**

Film entertainment is big business in the United States and it was estimated that the film entertainment business generated $35.3B in revenue in 2019 (Watson, 2020). The United States is among the biggest film industries in the world in general but also in terms of tickets sold per year, ranking behind China and India.

Microsoft sees all the big companies creating original video content, and they want to get in on the fun. They have decided to create a new movie studio, but the problem is they don’t know anything about creating movies. They have hired Flatiron Data Science team to help them better understand the movie industry. Our team is charged with doing data analysis and creating a presentation that explores what type of films are currently doing the best at the box office. We will then translate those findings into actionable insights that the CEO can use when deciding what type of films they should be creating.

In this report, we will investigate factors associated with commercially successful movies. This report gives a comprehensive evaluation on factors influencing the box office success of a movie such as production budget, domestic gross, international gross, worldwide gross, genre, source, creative type, production method, vote count, vote average, popularity , release time, runtime, studio, language. The business statements are formulated based on these attributes.

## **1.1 Business Statement**

**Q1.** Is there a correlation between **production budget** and **profit**? If so, how much should Microsoft invest into production?

**Q2.** What kind of movie contents, in terms of **genre**, **source**, **creative type**, **production method**, perform the best?

**Q3.** Is there a correlation between **popularity** and **positive words of mouth (average rating)** and profit? How do they affect the performance of a movie?

**Q4.** When is the best time of year to **release** a movie?

**Q5.** Is there a correlation between **runtime** and profit? What is the best runtime?

These questions were picked because quantitative factors that measure a movie’s success such as the production budget and gross are easily obtainable from reputable industry standard websites like Box Office Mojo, IMDB, Rotten Tomatoes, The MovieDB, and The Numbers. Other attributes such as genres, sources, creative types, production methods, popularity score, average rating, runtime, release date, and production studio are also readily available.

From a business perspective, these questions are important because it costs around 65M to produce a major studio movie, plus another 35M for marketing and distribution, so getting it right is crucial (Staff, 2017). As we will see later, not all movies make profit and many take in losses.

With many movies, the product life cycle is very short, averaging 9.6 weeks and can be as short as 2 weeks (Stimpert et al., 2008). This cycle is characterized by a peak in revenues at the time of release and then exponentially decay (Stimpert). This is why it is significantly important to “get it right” by the time the movie hits the theater.

# 2. DATA CLEANING & PREPARATION FROM PROVIDED DATA

## **I.2.1 Methodology**

## **I.2.2 Data Source**

Data for this project was obtained from the following repository and also saved in ZippedData folder in this repository.

The data comes from:

1.   Box Office Mojo
2.   IMDB
3.   Rotten Tomatoes
4.   TheMovieDB.org

## I.2.3 Data Reading

First, import all required packages:

In [313]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

From a glance, we see that we have many files to go through. Let's use glob() to retrieve all the file paths:

In [314]:
#the glob module is used to retrieve files/pathnames matching a specified pattern
from glob import glob

In [315]:
# Create a list of all .csv files using glob()
csv_files = glob("./zippedData/*.csv.gz")
csv_files

['./zippedData/imdb.title.crew.csv.gz',
 './zippedData/tmdb.movies.csv.gz',
 './zippedData/imdb.title.akas.csv.gz',
 './zippedData/imdb.title.ratings.csv.gz',
 './zippedData/imdb.name.basics.csv.gz',
 './zippedData/imdb.title.basics.csv.gz',
 './zippedData/tn.movie_budgets.csv.gz',
 './zippedData/bom.movie_gross.csv.gz',
 './zippedData/imdb.title.principals.csv.gz']

In [316]:
# Create a list of all tsv files using glob
tsv_files = glob("./zippedData/*.tsv.gz")
tsv_files

['./zippedData/rt.reviews.tsv.gz', './zippedData/rt.movie_info.tsv.gz']

As we will see, there are a lot of information to go through. However, because of the time constraint and for the scope of this project, I will selectively pick and choose just a few features to do analysis on.

### **Create dataframes from provided data**

### Production Budget vs. Gross:

In [317]:
#Create dataframe
movie_budgets_df = pd.read_csv('./zippedData/tn.movie_budgets.csv.gz') #selected
movie_budgets_df.head(2)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"

In [318]:
#Create dataframe
movie_gross_df = pd.read_csv('./zippedData/bom.movie_gross.csv.gz') #selected
movie_gross_df.head(2)

                        title studio  domestic_gross foreign_gross  year
0                 Toy Story 3     BV     415000000.0     652000000  2010
1  Alice in Wonderland (2010)     BV     334200000.0     691300000  2010

When it comes to box office dollars, the recipe for a successful movie is pretty simple: small budget + massive ticket sales = huge profit! Hence, we will utilize the **movie_budgets_df** and **movie_gross_df** to firgure out profit and use that information to do further analysis on all other features such as genre, runtime, release date, etc.

### Movie Basics:

In [319]:
#Create dataframe
title_basics_df = pd.read_csv('./zippedData/imdb.title.basics.csv.gz') #selected
title_basics_df.head(2)

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"

Features that are worth investigating are 'genre' and 'runtime'. We will pick **title_basics_df** to work with. 'tconst', which is a unique movie identifier, is also useful to do merge between all IMDB datasets.

### Popularity/ Words of Mouth:

In [320]:
#Create dataframe
movies_df = pd.read_csv('./zippedData/tmdb.movies.csv.gz') #selected
movies_df.head(2)

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610

**movies_df** is selected for 'original_language', 'popularity', 'vote_average' and 'vote_count'

Positive word of mouth has an enormous effect on the success of the movie. We can use the movie_df and title_rating below to observe the correlation between vote_count, vote_average and genres to see which genre has the highest attention from the audience. It also includes release date, which is also an important factor contributing to the movie success i.e. the timing and appropriateness of its release schedule.

In [321]:
#Create dataframe
title_rating_df = pd.read_csv('./zippedData/imdb.title.ratings.csv.gz') #selected
title_rating_df.head(2)

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559

We are interested in how positive words of mouth affect the success of a movie. **title_rating_df** offers us this information with 'averagerating' and 'numvotes.'

## I.2.4 Data Cleaning

1. Remove duplicates or irrelevant observations
2. Handle misisng data
3. Filter unwanted outliers

## I.2.4.a Production Budget & Gross:

First investigate the budget and gross since this is the purpose of this project is to make money. Let's see our data once more time:

**movie_budgets_df**

We are interested 'release_date', 'movie', 'production_budget', 'domestic_gross', and 'worldwide_gross'

In [322]:
#look at dataset again
movie_budgets_df.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [323]:
#data summary
movie_budgets_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [324]:
#check for duplicates
movie_budgets_df.duplicated().any()

False

In [325]:
#check for null values
movie_budgets_df.isnull().any()

id                   False
release_date         False
movie                False
production_budget    False
domestic_gross       False
worldwide_gross      False
dtype: bool

This dataframe looks good: no missing data, no duplicates. 
1. We don't need the 'id' column so we are going to drop that. 
2. We will also check to see if release_date is a datetime object and will handle it accordingly.
3. Drop the '$' and ',' from 'production_budget', 'domestic_gross', and 'worldwide_gros' and also convert them into integer.

In [326]:
#drop 'id' column
movie_budgets_df = movie_budgets_df.drop('id', axis = 1)
movie_budgets_df.head(2)

,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"

In [327]:
movie_budgets_df['release_date'][0]

'Dec 18, 2009'

In [328]:
#check to see if release_date is a datetime object
import datetime
isinstance(movie_budgets_df['release_date'][0], datetime.date)

False

In [329]:
#convert release_date to a datetime object
movie_budgets_df['release_date'] = pd.to_datetime(movie_budgets_df['release_date'])

In [330]:
#check again
isinstance(movie_budgets_df['release_date'][0], datetime.date)

True

In [331]:
#check for the money values and convert them to integer if needed
print(type(movie_budgets_df['production_budget'][0]))
print(type(movie_budgets_df['domestic_gross'][0]))
print(type(movie_budgets_df['worldwide_gross'][0]))

<class 'str'>
<class 'str'>
<class 'str'>

In [332]:
#delete '$' and ',' and convert to int
def dollar_clean(dataframe, col):
    dataframe[col] = dataframe[col].str.replace('$', '').str.replace(',', '').astype('int')
    return dataframe

In [333]:
#apply dollar_clean function to the 3 columns
dollar_clean(movie_budgets_df, 'production_budget')
dollar_clean(movie_budgets_df, 'domestic_gross')
dollar_clean(movie_budgets_df, 'worldwide_gross')

,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,2009-12-18,Avatar,425000000,760507625,2776345279
1,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875
2,2019-06-07,Dark Phoenix,350000000,42762350,149762350
3,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963
4,2017-12-15,Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747
...,...,...,...,...,...
5777,2018-12-31,Red 11,7000,0,0
5778,1999-04-02,Following,6000,48482,240495
5779,2005-07-13,Return to the Land of Wonders,5000,1338,1338
5780,2015-09-29,A Plague So Pleasant,1400,0,0
5781,2005-08-05,My Date With Drew,1100,181041,181041

In [334]:
#obtain summary statistics
movie_budgets_df.describe()

       production_budget  domestic_gross  worldwide_gross
count       5.782000e+03    5.782000e+03     5.782000e+03
mean        3.158776e+07    4.187333e+07     9.148746e+07
std         4.181208e+07    6.824060e+07     1.747200e+08
min         1.100000e+03    0.000000e+00     0.000000e+00
25%         5.000000e+06    1.429534e+06     4.125415e+06
50%         1.700000e+07    1.722594e+07     2.798445e+07
75%         4.000000e+07    5.234866e+07     9.764584e+07
max         4.250000e+08    9.366622e+08     2.776345e+09

In [335]:
#create 'year' column
movie_budgets_df['release_year'] = pd.DatetimeIndex(movie_budgets_df['release_date']).year

In [336]:
#view data
movie_budgets_df.head(2)

,release_date,movie,production_budget,domestic_gross,worldwide_gross,release_year
0,2009-12-18,Avatar,425000000,760507625,2776345279,2009
1,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,2011

**movies_gross_df**

In [337]:
#see the data again
movie_gross_df.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [338]:
#get data summary
movie_gross_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [339]:
#check for null values
movie_gross_df.isnull().sum()

title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

In [340]:
#calculate percentage of missing data in domestic_gross
print('Percentage of missing data in domestic_gross:', movie_gross_df['domestic_gross'].isnull().sum() / len(movie_gross_df) * 100)

#calculate percentage of missing data in foreign_gross
print('Percentage of missing data in foreign_gross:', movie_gross_df['foreign_gross'].isnull().sum() / len(movie_gross_df) * 100)

Percentage of missing data in domestic_gross: 0.8266902863891349
Percentage of missing data in foreign_gross: 39.85828166519043

There are missing values in 'domestic_gross' and 'foreign_gross' but we won't be using these column anyways. We already have this information in previous dataset. We will drop these columns in this dataset.

In [341]:
#drop null-containing columns
movie_gross_df = movie_gross_df.drop(['domestic_gross', 'foreign_gross', 'year'], axis = 1)

In [342]:
movie_gross_df.head(2)

                        title studio
0                 Toy Story 3     BV
1  Alice in Wonderland (2010)     BV

In [343]:
#calculate percentage of missing data in 'studio'
(movie_gross_df['studio'].isnull().sum() / len(movie_gross_df) * 100).round(2)

0.15

Missing values in 'studio' is not significant, we will safely drop them

In [344]:
movie_gross_df = movie_gross_df.dropna()

In [345]:
#check again
movie_gross_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3382 entries, 0 to 3386
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   title   3382 non-null   object
 1   studio  3382 non-null   object
dtypes: object(2)
memory usage: 79.3+ KB

In [346]:
#rename column
movie_gross_df = movie_gross_df.rename(columns={'title':'movie'})
movie_gross_df.head(2)

                        movie studio
0                 Toy Story 3     BV
1  Alice in Wonderland (2010)     BV

Merging **movie_budgets_df** and **movie_gross_df** using 'movie'

In [347]:
#merging dataset
movie_budgets_gross_df = pd.merge(movie_budgets_df, movie_gross_df, on='movie')
movie_budgets_gross_df.head()

,release_date,movie,production_budget,domestic_gross,worldwide_gross,release_year,studio
0,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,2011,BV
1,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963,2015,BV
2,2018-04-27,Avengers: Infinity War,300000000,678815482,2048134200,2018,BV
3,2017-11-17,Justice League,300000000,229024295,655945209,2017,WB
4,2015-11-06,Spectre,300000000,200074175,879620923,2015,Sony

In [348]:
#check for size
len(movie_budgets_gross_df)

1246

In [349]:
#save
movie_budgets_gross_df.to_csv('movie_budgets_gross_df')

## I.2.4.c Movie Basics: Genre, Runtime

**title_basics_df**

In [350]:
#see the dataset again
title_basics_df.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [351]:
#get data summary
title_basics_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   tconst           146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

In [352]:
#check for duplicates
title_basics_df.duplicated().any()

False

In [353]:
#check for null values
title_basics_df.isnull().any()

tconst             False
primary_title      False
original_title      True
start_year         False
runtime_minutes     True
genres              True
dtype: bool

In [354]:
#check for number of null values
title_basics_df.isnull().sum()

tconst                 0
primary_title          0
original_title        21
start_year             0
runtime_minutes    31739
genres              5408
dtype: int64

There is no duplicates in this dataframe but there are a lot of missing values in runtime_minutes, which is of our interest.

In [355]:
#calculate how big a percentage of the missing values in 'runtime_minutes' from the whole dataset is
((title_basics_df['runtime_minutes'].isnull().sum()) / (len(title_basics_df)) * 100).round(2)

21.72

21.71% is a big portion hence we cannot safely ignore or discard it. Let's check out its summary statistics

In [356]:
title_basics_df['runtime_minutes'].describe()

count    114405.000000
mean         86.187247
std         166.360590
min           1.000000
25%          70.000000
50%          87.000000
75%          99.000000
max       51420.000000
Name: runtime_minutes, dtype: float64

Both median and mean are quite close so we can pick either one. Let's go with median.

In [357]:
#fill missing values with median value
title_basics_df['runtime_minutes'] = title_basics_df['runtime_minutes'].fillna(title_basics_df['runtime_minutes'].median())

In [358]:
#check again
title_basics_df['runtime_minutes'].isnull().any()

False

In [359]:
#calculate how big a percentage of the missing values in 'original_title' from the whole dataset is
((title_basics_df['original_title'].isnull().sum()) / (len(title_basics_df)) * 100).round(2)

0.01

This is a very small percentage so we can drop it.

In [360]:
#calculate how big a percentage of the missing values in 'genres' from the whole dataset is
((title_basics_df['genres'].isnull().sum()) / (len(title_basics_df)) * 100).round(2)

3.7

This is also a very small percentage so we will drop it too.

In [361]:
#drop null values
title_basics_df = title_basics_df.dropna()

In [362]:
#check again
title_basics_df.isnull().any()

tconst             False
primary_title      False
original_title     False
start_year         False
runtime_minutes    False
genres             False
dtype: bool

In [363]:
#rename 'primary_title' to 'movie' to be consistent with our main dataframe
title_basics_df = title_basics_df.rename(columns={'primary_title':'movie'})
title_basics_df.head(2)

,tconst,movie,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"

In [364]:
#drop 'original_title' because it's redundant
title_basics_df = title_basics_df.drop('original_title', axis = 1)
title_basics_df.head(2)

,tconst,movie,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,2019,114.0,"Biography,Drama"

In [365]:
#drop 'start_year' because it's redundant
title_basics_df = title_basics_df.drop('start_year', axis = 1)
title_basics_df.head(2)

,tconst,movie,runtime_minutes,genres
0,tt0063540,Sunghursh,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,114.0,"Biography,Drama"

## I.2.4.b Popularity / Words of Mouth: Rating, Number of Votes, Popularity

**movies_df**

In [366]:
#let see the dataframe again
movies_df.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [367]:
#drop unnescessary columns
movies_df = movies_df.drop(['Unnamed: 0', 'genre_ids', 'id', 'original_title'], axis = 1)

In [368]:
#review
movies_df.head(2)

,original_language,popularity,release_date,title,vote_average,vote_count
0,en,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,en,28.734,2010-03-26,How to Train Your Dragon,7.7,7610

In [369]:
#get data summary
movies_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   original_language  26517 non-null  object
 1   popularity         26517 non-null  float64
 2   release_date       26517 non-null  object
 3   title              26517 non-null  object
 4   vote_average       26517 non-null  float64
 5   vote_count         26517 non-null  int64
dtypes: float64(2), int64(1), object(3)
memory usage: 1.2+ MB

In [370]:
#check to see if release_date is datetime object
import datetime
isinstance(movies_df['release_date'][0], datetime.date)

False

In [371]:
#convert release_date to datetime object
movies_df['release_date'] = pd.to_datetime(movies_df['release_date'])

In [372]:
#check again
isinstance(movies_df['release_date'][0], datetime.date)

True

In [373]:
#check for duplicates
movies_df.duplicated().sum()

1020

In [374]:
#check for duplicates
movies_df['title'].duplicated().sum()

1829

The same movies can be remade and released at different times, hence we need to create a 'year' column so that we can merge using 'movie' and 'year' to make sure we don't mistake the movie versions with each other.

In [375]:
#create a separated 'year' column 
movies_df['release_year'] = pd.DatetimeIndex(movies_df['release_date']).year

In [376]:
#review
movies_df.head(2)

,original_language,popularity,release_date,title,vote_average,vote_count,release_year
0,en,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788,2010
1,en,28.734,2010-03-26,How to Train Your Dragon,7.7,7610,2010

In [377]:
#show duplicates
duplicates = movies_df[movies_df.duplicated(subset = "title")]
duplicates.head(20)

,original_language,popularity,release_date,title,vote_average,vote_count,release_year
781,en,2.235,2010-01-03,Brotherhood,6.2,31,2010
1037,tl,1.504,2009-06-01,Boy,7.5,2,2009
1230,en,1.241,2010-09-25,All That Glitters,10.0,1,2010
1501,en,0.840,2010-02-06,Zero,5.8,6,2010
1708,en,0.624,2010-01-01,The Gift,9.0,1,2010
2081,en,0.600,2010-01-01,Alice in Wonderland,6.0,1,2010
2290,en,0.600,2010-07-31,Lies Between Friends,4.8,4,2010
2473,en,28.005,1995-11-22,Toy Story,7.9,10174,1995
2477,en,22.698,1999-11-24,Toy Story 2,7.5,7553,1999
2536,en,13.459,2010-12-10,TRON: Legacy,6.3,4387,2010
2560,en,12.254,2011-04-08,Your Highness,5.3,735,2011
2601,en,10.730,2011-08-17,The Awakening,6.4,782,2011
2673,en,8.994,2010-12-29,Blue Valentine,6.9,1677,2010
2717,en,8.319,2010-09-01,Rubber,5.9,417,2010
2803,en,7.357,2011-01-14,Barney's Version,7.2,210,2011
2854,en,6.667,2011-10-29,Zombie Apocalypse,4.4,56,2011
2901,en,6.136,2011-03-16,Detention,5.6,206,2011
2919,en,5.938,2011-05-13,Skateland,5.4,16,2011
2946,es,5.552,2011-08-19,The Last Circus,6.7,177,2011
2956,en,5.444,2011-07-15,Lucky,4.9,38,2011

In [378]:
#check for number of duplicates
len(duplicates)

1829

In [379]:
#check to see if duplicates are remakes of each other
duplicates[duplicates['title'] == 'Brotherhood']

,original_language,popularity,release_date,title,vote_average,vote_count,release_year
781,en,2.235,2010-01-03,Brotherhood,6.2,31,2010
18130,en,4.191,2016-09-08,Brotherhood,6.1,54,2016

In [380]:
#check to see if duplicates are remakes of each other
duplicates[duplicates['title'] == 'Boy']

,original_language,popularity,release_date,title,vote_average,vote_count,release_year
1037,tl,1.504,2009-06-01,Boy,7.5,2,2009
5404,en,7.759,2012-03-02,Boy,7.5,149,2012
12991,da,0.718,2014-06-20,Boy,6.0,4,2014

There are a lot of versions for many of these movies. I have made the decision to only use the latest version of the movie since it is most up to date.
We will use both 'movie' and 'release_year' to merge this dataset with the main dataframe so that we only keep the most relevant version of the movies.

In [381]:
#rename column
movies_df = movies_df.rename(columns={'title':'movie'})
movies_df.head(2)

,original_language,popularity,release_date,movie,vote_average,vote_count,release_year
0,en,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788,2010
1,en,28.734,2010-03-26,How to Train Your Dragon,7.7,7610,2010

In [382]:
#Let's only keep the lastest remake for simplicity
#sort from lastest to oldest
movies_df = movies_df.sort_values('release_year', ascending = False)

In [383]:
#keep the latest release/remake
movies_df = movies_df.drop_duplicates(subset = 'movie', keep = 'first')

In [384]:
#check again
movies_df.duplicated().sum()

0

**title_rating_df**

In [385]:
#review data
title_rating_df.head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [386]:
#check for null values
title_rating_df.isnull().sum()

tconst           0
averagerating    0
numvotes         0
dtype: int64

In [387]:
#check for duplicates
title_rating_df.duplicated().any()

False

This dataset looks great.

We are now ready to merge what we have so far:

In [388]:
#merging using 'tconst'
title_basics_rating_df = pd.merge(title_basics_df, title_rating_df, on='tconst')

In [389]:
title_basics_rating_df.head()

,tconst,movie,runtime_minutes,genres,averagerating,numvotes
0,tt0063540,Sunghursh,175.0,"Action,Crime,Drama",7.0,77
1,tt0066787,One Day Before the Rainy Season,114.0,"Biography,Drama",7.2,43
2,tt0069049,The Other Side of the Wind,122.0,Drama,6.9,4517
3,tt0069204,Sabse Bada Sukh,87.0,"Comedy,Drama",6.1,13
4,tt0100275,The Wandering Soap Opera,80.0,"Comedy,Drama,Fantasy",6.5,119

In [390]:
len(title_basics_rating_df)

73052

In [391]:
#rename column
title_basics_rating_df = title_basics_rating_df.rename(columns={'primary_title':'movie', 'averagerating':'average_rating', 'numvotes':'num_votes'})

In [392]:
#drop unnecessary columns
title_basics_rating_df = title_basics_rating_df.drop(['genres'], axis=1)

In [393]:
#check
title_basics_rating_df.head()

,tconst,movie,runtime_minutes,average_rating,num_votes
0,tt0063540,Sunghursh,175.0,7.0,77
1,tt0066787,One Day Before the Rainy Season,114.0,7.2,43
2,tt0069049,The Other Side of the Wind,122.0,6.9,4517
3,tt0069204,Sabse Bada Sukh,87.0,6.1,13
4,tt0100275,The Wandering Soap Opera,80.0,6.5,119

## I.2.5 Merging Everything Together

Let's now merge it all together **movie_budgets_gross_df** and **movies_df** using 'movie' and 'release_year'

There is a big difference between 2 dataframes so we are expecting some data downsize when merging.

In [394]:
#merge using 'movie' and 'release_date'
df1 = pd.merge(movie_budgets_gross_df, movies_df, on=['movie', 'release_date'])

In [395]:
#preview
df1.head()

,release_date,movie,production_budget,domestic_gross,worldwide_gross,release_year_x,studio,original_language,popularity,vote_average,vote_count,release_year_y
0,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,2011,BV,en,30.579,6.4,8571,2011
1,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963,2015,BV,en,44.383,7.3,13457,2015
2,2018-04-27,Avengers: Infinity War,300000000,678815482,2048134200,2018,BV,en,80.773,8.3,13948,2018
3,2017-11-17,Justice League,300000000,229024295,655945209,2017,WB,en,34.953,6.2,7510,2017
4,2015-11-06,Spectre,300000000,200074175,879620923,2015,Sony,en,30.318,6.4,6719,2015

In [396]:
#check for size
df1.shape

(902, 12)

In [397]:
#get data summary
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 902 entries, 0 to 901
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   release_date       902 non-null    datetime64[ns]
 1   movie              902 non-null    object
 2   production_budget  902 non-null    int64
 3   domestic_gross     902 non-null    int64
 4   worldwide_gross    902 non-null    int64
 5   release_year_x     902 non-null    int64
 6   studio             902 non-null    object
 7   original_language  902 non-null    object
 8   popularity         902 non-null    float64
 9   vote_average       902 non-null    float64
 10  vote_count         902 non-null    int64
 11  release_year_y     902 non-null    int64
dtypes: datetime64[ns](1), float64(2), int64(6), object(3)
memory usage: 91.6+ KB

In [398]:
#check for duplicates
df1['movie'].duplicated().sum()

0

Next, merging **df_1** with **title_basics_rating_df**

In [399]:
merged_df_1 = pd.merge(df1, title_basics_rating_df, on=['movie'])
merged_df_1.head()

,release_date,movie,production_budget,domestic_gross,worldwide_gross,release_year_x,studio,original_language,popularity,vote_average,vote_count,release_year_y,tconst,runtime_minutes,average_rating,num_votes
0,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,2011,BV,en,30.579,6.4,8571,2011,tt1298650,136.0,6.6,447624
1,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963,2015,BV,en,44.383,7.3,13457,2015,tt2395427,141.0,7.3,665594
2,2018-04-27,Avengers: Infinity War,300000000,678815482,2048134200,2018,BV,en,80.773,8.3,13948,2018,tt4154756,149.0,8.5,670926
3,2017-11-17,Justice League,300000000,229024295,655945209,2017,WB,en,34.953,6.2,7510,2017,tt0974015,120.0,6.5,329135
4,2015-11-06,Spectre,300000000,200074175,879620923,2015,Sony,en,30.318,6.4,6719,2015,tt2379713,148.0,6.8,352504

In [400]:
#check for dataset size
len(merged_df_1)

1019

In [401]:
#get data summary
merged_df_1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1019 entries, 0 to 1018
Data columns (total 16 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   release_date       1019 non-null   datetime64[ns]
 1   movie              1019 non-null   object
 2   production_budget  1019 non-null   int64
 3   domestic_gross     1019 non-null   int64
 4   worldwide_gross    1019 non-null   int64
 5   release_year_x     1019 non-null   int64
 6   studio             1019 non-null   object
 7   original_language  1019 non-null   object
 8   popularity         1019 non-null   float64
 9   vote_average       1019 non-null   float64
 10  vote_count         1019 non-null   int64
 11  release_year_y     1019 non-null   int64
 12  tconst             1019 non-null   object
 13  runtime_minutes    1019 non-null   float64
 14  average_rating     1019 non-null   float64
 15  num_votes          1019 non-null   int64
dtypes: datetime64[ns](1), float64(4), int64(7), object(4)
memory usage: 135.3+ KB

In [402]:
merged_df_1.isnull().sum()

release_date         0
movie                0
production_budget    0
domestic_gross       0
worldwide_gross      0
release_year_x       0
studio               0
original_language    0
popularity           0
vote_average         0
vote_count           0
release_year_y       0
tconst               0
runtime_minutes      0
average_rating       0
num_votes            0
dtype: int64

In [403]:
len(merged_df_1)

1019

In [404]:
#check for duplicates
merged_df_1.duplicated().sum()

0

In [405]:
#drop unneeded columns
merged_df_1 = merged_df_1.drop(['release_year_y'], axis = 1)

In [406]:
#rename columns
merged_df_1 = merged_df_1.rename(columns={'release_year_x':'release_year', 'original_language':'language'})

In [407]:
merged_df_1.head()

,release_date,movie,production_budget,domestic_gross,worldwide_gross,release_year,studio,language,popularity,vote_average,vote_count,tconst,runtime_minutes,average_rating,num_votes
0,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,2011,BV,en,30.579,6.4,8571,tt1298650,136.0,6.6,447624
1,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963,2015,BV,en,44.383,7.3,13457,tt2395427,141.0,7.3,665594
2,2018-04-27,Avengers: Infinity War,300000000,678815482,2048134200,2018,BV,en,80.773,8.3,13948,tt4154756,149.0,8.5,670926
3,2017-11-17,Justice League,300000000,229024295,655945209,2017,WB,en,34.953,6.2,7510,tt0974015,120.0,6.5,329135
4,2015-11-06,Spectre,300000000,200074175,879620923,2015,Sony,en,30.318,6.4,6719,tt2379713,148.0,6.8,352504

## I.2.6 Quick Data Analysis

We need to know the profit which is calculated by taking the difference between 'worldwide_gross' and 'production_budget'

In [408]:
#Let's calculate profit each movie makes
#Add 'worldwide_profit' to get total profit
merged_df_1['worldwide_profit'] = merged_df_1.apply(lambda x: x['worldwide_gross'] - x['production_budget'], axis = 1)

#Add 'domestic_profit' to get profit generated within US and Canada
merged_df_1['domestic_profit'] = merged_df_1.apply(lambda x: x['domestic_gross'] - x['production_budget'], axis = 1)

In [409]:
#review
merged_df_1.head(2)

,release_date,movie,production_budget,domestic_gross,worldwide_gross,release_year,studio,language,popularity,vote_average,vote_count,tconst,runtime_minutes,average_rating,num_votes,worldwide_profit,domestic_profit
0,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,2011,BV,en,30.579,6.4,8571,tt1298650,136.0,6.6,447624,635063875,-169536125
1,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963,2015,BV,en,44.383,7.3,13457,tt2395427,141.0,7.3,665594,1072413963,128405868

In [410]:
#save
merged_df_1.to_csv('merged_df_1')

In [411]:
merged_df_1.describe()

,production_budget,domestic_gross,worldwide_gross,release_year,popularity,vote_average,vote_count,runtime_minutes,average_rating,num_votes,worldwide_profit,domestic_profit
count,1.019000e+03,1.019000e+03,1.019000e+03,1019.00000,1019.000000,1019.000000,1019.000000,1019.000000,1019.000000,1.019000e+03,1.019000e+03,1.019000e+03
mean,5.019671e+07,6.616258e+07,1.659168e+08,2014.07949,14.400321,6.389794,2511.943081,107.014720,6.409028,1.233324e+05,1.157201e+08,1.596587e+07
std,5.765726e+07,8.913557e+07,2.453901e+08,2.55366,8.055077,0.774098,3092.699615,19.014439,1.018887,1.736132e+05,2.035635e+08,6.403072e+07
min,5.000000e+04,0.000000e+00,1.706100e+04,2010.00000,0.600000,4.000000,11.000000,40.000000,1.600000,5.000000e+00,-1.104502e+08,-2.019413e+08
25%,1.200000e+07,1.303880e+07,2.415421e+07,2012.00000,9.226500,5.900000,583.000000,94.000000,5.800000,1.843550e+04,5.530697e+06,-1.062608e+07
50%,3.000000e+07,3.713422e+07,7.589810e+07,2014.00000,12.408000,6.400000,1370.000000,105.000000,6.500000,6.736700e+04,4.113406e+07,2.531500e+06
75%,6.000000e+07,7.663298e+07,1.805738e+08,2016.00000,17.148000,6.900000,3030.000000,118.000000,7.100000,1.485060e+05,1.288192e+08,3.184655e+07
max,4.106000e+08,7.000596e+08,2.048134e+09,2018.00000,80.773000,8.400000,22186.000000,180.000000,9.200000,1.841066e+06,1.748134e+09,5.000596e+08

We can see that our dataset consist of movies from 2010 to 2018. We want to also find out information such as source, creative type, production method as well. To do this, we will scrape www.the-numbers.com